In [22]:
#Importing needed libraries
import pandas as pd
import datetime as DT

In [16]:
#Loading data

loaded_data = pd.read_csv('Adops & Data Scientist Sample Data - Q1 Analytics.csv')
loaded_data.head()

                    ts user_id country_id site_id
0  2019-02-01 00:01:24  LC36FC        TL6   N0OTG
1  2019-02-01 00:10:19  LC39B6        TL6   N0OTG
2  2019-02-01 00:21:50  LC3500        TL6   N0OTG
3  2019-02-01 00:22:50  LC374F        TL6   N0OTG
4  2019-02-01 00:23:44  LCC1C3        TL6   QGO3G

In [17]:
#Data load check
loaded_data.shape

(3553, 4)

In [18]:
#Question 1 - Part 1

data_bdv['site_id'].nunique()

3

In [19]:
data_bdv = loaded_data[loaded_data['country_id']=='BDV']
temp = data_bdv.groupby('site_id')['user_id'].nunique().to_frame()
temp = temp.reset_index()
temp.columns = ['site_id', 'counts']

In [20]:
temp.sort_values('counts',ascending = False).head(1)

  site_id  counts
1   5NPAU     544

In [40]:
#Question 2 - Part 1

loaded_data['ts'] = pd.to_datetime(loaded_data['ts'])
temp_dataframe = loaded_data.loc[(loaded_data.ts > DT.datetime(2019,2,3,0,0,0)) & (loaded_data.ts < DT.datetime(2019,2,4,23,59,59))]

In [39]:
final_counts_df = temp_dataframe.groupby(['user_id', 'site_id'])['ts'].count().to_frame().reset_index()

In [38]:
final_counts_df.columns = ['user_id', 'site_id', 'number of visits']
final_counts_df.sort_values('number of visits',ascending = False)
final_counts_df[final_counts_df['number of visits']>10].sort_values('number of visits',ascending = False)

    user_id site_id  number of visits
417  LC3A59   N0OTG                26
3    LC06C3   N0OTG                25
493  LC3C9D   N0OTG                17
485  LC3C7E   3POLC                15

In [41]:
#Question 3 - Part 1

last_visited_df = loaded_data.groupby('user_id')['ts'].max().to_frame().reset_index()
last_visited_df.head(10)

  user_id                  ts
0  LC00C3 2019-02-03 18:52:50
1  LC01C3 2019-02-04 11:35:10
2  LC05C3 2019-02-02 14:14:44
3  LC06C3 2019-02-07 01:16:12
4  LC07C3 2019-02-05 19:06:42
5  LC08C3 2019-02-05 16:11:30
6  LC0C32 2019-02-07 01:18:03
7  LC0C34 2019-02-06 21:01:55
8  LC0C35 2019-02-01 17:44:39
9  LC0C3B 2019-02-01 22:02:40

In [42]:
last_site_visited_df = last_visited_df.merge(loaded_data, on = ['user_id','ts'], how = 'left')
last_site_visited_df.head(5)

  user_id                  ts country_id site_id
0  LC00C3 2019-02-03 18:52:50        QLT   5NPAU
1  LC01C3 2019-02-04 11:35:10        QLT   5NPAU
2  LC05C3 2019-02-02 14:14:44        BDV   5NPAU
3  LC06C3 2019-02-07 01:16:12        TL6   N0OTG
4  LC07C3 2019-02-05 19:06:42        BDV   5NPAU

In [45]:
last_site_visited_df.groupby('site_id')['user_id'].count().to_frame().sort_values('user_id', ascending = False).reset_index()

  site_id  user_id
0   5NPAU      992
1   N0OTG      561
2   QGO3G      289
3   GVOFK       42
4   3POLC       28
5   RT9Z6        2
6   EUZ/Q        1
7   JSUUP        1

In [52]:
#Question 4 - Part 1

first_visits_df = loaded_data.groupby('user_id')['ts'].min().to_frame().reset_index()

first_visit_site_df = first_visits_df.merge(loaded_data, on = ['user_id','ts'], how = 'left')

In [47]:
final_df = last_site_visited_df.merge(first_visit_site_df, on = 'user_id', how = 'left')
final_df.head(5)

,user_id,ts_x,country_id_x,site_id_x,ts_y,country_id_y,site_id_y
0,LC00C3,2019-02-03 18:52:50,QLT,5NPAU,2019-02-03 18:52:50,QLT,5NPAU
1,LC01C3,2019-02-04 11:35:10,QLT,5NPAU,2019-02-04 11:35:10,QLT,5NPAU
2,LC05C3,2019-02-02 14:14:44,BDV,5NPAU,2019-02-02 14:14:44,BDV,5NPAU
3,LC06C3,2019-02-07 01:16:12,TL6,N0OTG,2019-02-01 22:49:39,TL6,N0OTG
4,LC07C3,2019-02-05 19:06:42,BDV,5NPAU,2019-02-05 19:06:42,BDV,5NPAU

In [51]:
final_df[final_df['site_id_x']==final_df['site_id_y']].shape[0]

1670